#01: Menyertakan Prefix dan Suffix pada seluruh Kolom Data Frame

In [2]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.3.3
2.3.5

In [7]:
n_rows = 8
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 10, size=(n_rows, n_cols)), 
                  columns=cols)
df

   A  B  C  D  E
0  4  5  2  3  5
1  7  7  4  1  1
2  7  7  7  2  5
3  9  9  4  6  6
4  2  1  2  9  9
5  9  9  5  7  7
6  7  8  6  4  9
7  4  4  6  2  9

In [8]:
tuple('ABCDE')

('A', 'B', 'C', 'D', 'E')

In [9]:
df.add_prefix('kolom_')

   kolom_A  kolom_B  kolom_C  kolom_D  kolom_E
0        4        5        2        3        5
1        7        7        4        1        1
2        7        7        7        2        5
3        9        9        4        6        6
4        2        1        2        9        9
5        9        9        5        7        7
6        7        8        6        4        9
7        4        4        6        2        9

In [10]:
df.add_suffix('_field')

   A_field  B_field  C_field  D_field  E_field
0        4        5        2        3        5
1        7        7        4        1        1
2        7        7        7        2        5
3        9        9        4        6        6
4        2        1        2        9        9
5        9        9        5        7        7
6        7        8        6        4        9
7        4        4        6        2        9

#02: Pemilihan baris (rows selection) pada Data Frame

In [11]:
n_rows = 10
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 5, size=(n_rows, n_cols)), 
                  columns=cols)
df

   A  B  C  D  E
0  4  1  4  3  4
1  2  1  4  3  3
2  4  2  1  2  1
3  3  3  3  4  3
4  3  1  4  3  3
5  3  1  1  2  1
6  4  1  3  2  4
7  4  1  1  2  3
8  4  3  2  1  4
9  4  3  4  3  1

In [12]:
df[(df['A'] == 1) | (df['A'] == 3)]

   A  B  C  D  E
3  3  3  3  4  3
4  3  1  4  3  3
5  3  1  1  2  1

In [13]:
df[df['A'].isin([1, 3])]

   A  B  C  D  E
3  3  3  3  4  3
4  3  1  4  3  3
5  3  1  1  2  1

In [14]:
df[~df['A'].isin([1, 3])]

   A  B  C  D  E
0  4  1  4  3  4
1  2  1  4  3  3
2  4  2  1  2  1
6  4  1  3  2  4
7  4  1  1  2  3
8  4  3  2  1  4
9  4  3  4  3  1

#03: Konversi tipe data String ke Numerik pada kolom Data Frame

In [15]:
data = {'col1':['1', '2', '3', 'teks'], 
        'col2':['1', '2', '3', '4']}

df = pd.DataFrame(data)
df

   col1 col2
0     1    1
1     2    2
2     3    3
3  teks    4

In [16]:
df.dtypes

col1    object
col2    object
dtype: object

In [17]:
df_x = df.astype({'col2':'int'})
df_x

   col1  col2
0     1     1
1     2     2
2     3     3
3  teks     4

In [18]:
df.apply(pd.to_numeric, errors='coerce')

   col1  col2
0   1.0     1
1   2.0     2
2   3.0     3
3   NaN     4

#04: Pemilihan kolom (columns selection) pada Data Frame berdasarkan tipe data

In [19]:
n_rows = 5
n_cols = 2
cols = ['bil_pecahan', 'bil_bulat']

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)), columns=cols)

df['bil_pecahan'] = df['bil_pecahan'].astype('float')

df.index = pd.date_range(start='2024-10-01', periods=n_rows, freq='h')

df = df.reset_index()
df['teks'] = list('ABCDE')

df

                index  bil_pecahan  bil_bulat teks
0 2024-10-01 00:00:00         18.0         13    A
1 2024-10-01 01:00:00         11.0          5    B
2 2024-10-01 02:00:00         14.0         18    C
3 2024-10-01 03:00:00          6.0          6    D
4 2024-10-01 04:00:00         10.0         17    E

In [20]:
df.dtypes

index          datetime64[ns]
bil_pecahan           float64
bil_bulat               int64
teks                   object
dtype: object

In [21]:
df.select_dtypes(include='number')

   bil_pecahan  bil_bulat
0         18.0         13
1         11.0          5
2         14.0         18
3          6.0          6
4         10.0         17

In [22]:
df.select_dtypes(include='float')

   bil_pecahan
0         18.0
1         11.0
2         14.0
3          6.0
4         10.0

In [23]:
df.select_dtypes(include='int')

   bil_bulat
0         13
1          5
2         18
3          6
4         17

In [24]:
df.select_dtypes(include='object')

  teks
0    A
1    B
2    C
3    D
4    E

In [25]:
df.select_dtypes(include='datetime')

                index
0 2024-10-01 00:00:00
1 2024-10-01 01:00:00
2 2024-10-01 02:00:00
3 2024-10-01 03:00:00
4 2024-10-01 04:00:00

In [26]:
df.select_dtypes(include=['number', 'object'])

   bil_pecahan  bil_bulat teks
0         18.0         13    A
1         11.0          5    B
2         14.0         18    C
3          6.0          6    D
4         10.0         17    E